string proof = """
ПОЛНОЕ ДОКАЗАТЕЛЬСТВО ВЕЛИКОЙ ТЕОРЕМЫ ФЕРМА
Студ. ЛЕЩИНСКИЙА. С
Белорусский национальный технический университет
История великой теоремы Ферма началась в
1637 г., когда французский математик Пьер
Ферма (1601... 1665) сформулировал теорему,
согласно которой при натуральном и > 2 урав
нение У +у" = г" не имеет решений в целых по
ложительных числах X , у , Z.
Для полного доказательства достаточно до
казать две теоремы.
Теорема 1.0. кг Ф 0 modp, где кг - второй
множитель числа классов идеалов кругового
поля QiCp)', р - простое нечетное число.
Теорема 2.0. Для простого показателя р > 5
справедлив второй случай теоремы Ферма,
если кг Фо modp.
Первый случай теоремы Ферма при
кгФО т о ф был доказан Вандивером. В даль
нейшем будем использовать обозначение ^ =
2я.
Теорема 2.1. Уравнение
У + / = ел'^У,
где X, у , Z, 8 6 Z[^ + 8 - единица кольца,
целое и > 1, простоер ^ 5, п = (I - Q(1 - не
им еет решений в ненулевых х, у, z.
□ Пусть уравнение имеет решение в нену
левых д:, у , Z.
Вестник БИТУ, № 4,2005 57
Естественные и точные науки
Из всех этих решений выберем такое, у ко
торого ы , модуль нормы элемента z, прини
мает минимальное значение
=(х”+ у ’) = (х+ у)П (х^ + Ў + x ) < s + c ) ) ,
1=1
где т = { р - 1)/2.
Так как кольцо Z(^ + ę^) допускает теорию
дивизоров с числом классов, равным кг, имеем:
( jc + y f =
+ / + ду(С + Ó ) = (n)K^9i,-, / = 1 , m,
где К - наибольший общий делитель главных
дивизоров (х) и (у), который не делится на (я).
Так как 91о, 91,- взаимно просты, то:
(х^ +у^ + 2 ху) = { n f - ;
( х Н / + лу(С + 0 ) = (я)К 'З Г ,
гдe9lo = Зo^9^,• = З f .
После перекрестного умножения этих урав
нений имеем
(х^ + / + 2ду) 3 f =
= (х^ + / + лу(С + ’>^3^'’ .
Умножим уравнение на дивизор 3^, такой
что З^^З^ = m l ” = (у)^ . Так как Лг ^ О т о ф ,
то дивизоры 3 ^ 3 f = (а,)^ - главные, тогда
(х ^ + / + 2 х у ) ( а / =
= (х^ + / + ху(с!+ ó y n f^ -^ ^ y Y -
Так как все дивизоры в уравнении главные,
для 1= 1,2 имеем:
бі(х^ + Ў + 2 ху) а ” =
= (х^ + / + ху(^ + - ’V ;
СгСх^ + + 2ху) a f =
= ( х Ч / + ду((;Ч С V ,
где El и 62 - единицы кольца Z[^ + ę \
После элементарных преобразований из по
следних двух уравнений с учетом равенства
е,(х^ + / -ь 2 л у К - + / + 2хуУрУ”-^”у”
+ 2 х у )а .^ - (х^ + у ^ + 2хуУ п У "''^”у ”
ду(С + С'^-2У^"~'>^у'’
получаем
6i o f + 662 = (1 + '^у'’,
( 1 - 0 ( 1 - ; - » )
где 6 = , . ^ - единица.( l _ ; 2 ) ( ę - 2 _ i )
Так как бз = е,"»662 - единица, а» = (1 + е) ejT»
- единица, тогда
оу +бз a f = б4Я^^ -
Пусть a f S f т о ф , oĄ s q т о ф , t + £зд = О
mod р м г з = г т о ф , где t, q, г е Z. Но если вер
но последнее сравнение, то 63 = ef (доказатель
ство этого факта будет приведено ниже). Тогда
0(’+ Рі^=84Я^^-»У,
где Pi = esOiz-
В итоге получим уравнение
xf + у ” = e4 T^”z{’,
где а , = хь Pi = у ь у = Zb 2л - 1 = иь
Теперь докажем, что І№І <>• lAfeJ :
Щ х^ + У + 2 л у )|(2 + С + С )) =
= Щя)^^'-‘>^’ к^з^^1(1 + С)(1 + Ó );
Щх^ + / +ДУ(С' + о ')) = М (Я )К'3? );
k ( (x ^ + / + 2x y ) i ( 2< + Ó ) | =
= (х^+/)(2 +С+С )+^ лу(2+С+С')) I <
< ІУ (х^+/+лу(С + Г))1.
Это неравенство верно, поскольку для лю
бых вещественных х и у и для любого i
58 Вестник БИТУ, Nb 4,2005
Естественные и точные науки
||(х ^ + /)(2 + С + С ')+ |л у (2 + С + 0 1 <
<1х^+/+^9<С + Г)1-
Значит, I (2 + С + Ó ) i
< к ((я )Х '3? ^ , так как 7У/(л) = /7, то
Так как и ^ 1, то I 1<| iV3f | и
N 311< I N3f I. Следовательно,
т
INz И| 1Y l\ iV5, l^ n iiV S , I> IЛ^о II 1;
1=0 1=0
\JNz\ > |iV3o||A^2i(, значит, jA/z|>|Afei|.
Пришли к противоречию, так как |Л(г| вы
бирали минимальным. ■
Из теоремы 2.1. следует теорема 2.0.
Единицы вида
± С П ( 1 - а ' С Г ,
/=1
т
где л = 2 ]« , =0> а = о, 1........р - 1, =
1=1
g*=g^m odp, 1 < g i < p - l , A : = 0 , 1,
где g - первообразный корень по модулю р,
образуют подгруппу группы всех единиц коль
ца Z[Q и называются специальными [1].
Фактор-группа единиц кольца по под
группе специальных единиц имеет поря
док hi.
Теорема 1.1. Любая специальная единица,
для которой существует такое целое число с,
что e s c modp, является р-й степенью неко
торой, тоже специальной единицы г\.
□ По условию теоремы имеем:
і С П О - а ' О " ' н стойр-,
т
+ с ^ П (1 -о ^ ^ '0 " ' а с m odp.
Пусть g - первообразный корень по модулю
р такой, что g'^’ S 1 mod р^.
Тождество
m / 1
1 - а ‘С j
верно при s = 1, 2 ,.. .,р - 2.
Так как
a lm o d p
П1=1 V 1 -а 'С I ’
то
т (
« / 1 _J+»>
1-<Г Ц
Ш I -О ';
+,>N"<-"7
s ± l m odp,
7 = 1, ...,т.
Из последнего следует, что существуют
многочлены, удовлетворяюпдае равенству
т
П 1 _ Х ^ - \щ-п.
1=1 ч
= ±\ + pF,s{X) + i^X)F^(X),
где F^si^) = RxsiX)
RisiX) , Fi^X) - отношение
1=1
многочленов с целыми коэффициентами;
ф (Х) = + Х / ’- Ч ... + ЛГ + 1 .
Берем логарифмическую производную от
обеих частей равенства и умножаем ее на X.
Далее подставляем вместо X = ę и вводим мно
гочлен £(Х )
т
£ ( X ) = £ (« ,-n ,.)(g X )'.
1=1
После этих преобразований получаем ра
венство по модулю р
Вестник БИТУ, №4, 2005 59
Естественные и точные науки
то
(а(я, - l ) + <^n^) + feo■
^ 2s(^) - единица.
Пусть a{g, -1 ) + </и, = -6 ,т о гд а 6 + (g,CT* - 1 ) х
ш ( а ) С = ę + g , e + - + g p - 2 > ^ " " ^ , 6 * 6 Z .
Так как
^ = gs mod р,
6 + ( g V - l ) £ ( a ) ^ ^ j s ^)^®(ст>; mod/?;
bp + ( g V - s b,pxn(oy; m o d /;
bp + ( g V - l)J?(a)iD(aX = 6,ptn(aX m od/ .
Для любого многочлена К(Х) верно
а д С і г K(g^~% mod / ,
где С, = ę + gai; + g^aX +... + g^'^o^'^i; .
Значит,
6 p to (g )+ (g V -l)£ (a M o )ę , s6,/?tn(CT)ę, m o d /;
o>(g) = l + ^ + - + ^ ' ’"^ s O m o d / ;
(g ^ - ‘> - l) £ ( g ^ - W '') C . ^6,/?tn(g'’-^ K ,m o d /;
g*0>-» = l m odp^
0 mod/», следовательно, b^sO mod p
п р и 5 = 1 , 2 , . . . , p - 2 .
Таким образом.
( g , a ^ - l № ) -bp m o d /,
1 ^ - 1 .
(g,o* -1>&(о)ш(ст>; S -bp m odp^
(g,a* - 1)£(ст)ш(«У)Сі = -6/?w(g) m o d /;
_ i)£(g^-X g^"^)C , = -bpaig ) m o d / .
Так как J ]n ,.= 0 , то £ ’(g^'^)s-Wymmod/?,
j=i
после умножения на g^
(gs-g')njf»^(g''^y^i = 0 m o d /
при5 = 0 , 1, . . . , p - 2 .
^ ( g s - g>;W®(g^"^Ki = 0 m o d /,
5 - 0
^ g " = 0 m o d /,
j= 0
5 ^ * ®m o d /,
s=0
следовательно, nj= 0 mod p, гдеу = 1 ,2 ,..., m , a - 0 .
Пусть r,=-j-, тогда ii = ±n(l-cj'Q '^ ' и
P ,=i
8 = Tj^ . ■
Следствие 1. Если верна теорема 1.1, то
любая единица е такая, что s = cmodp, являет
ся р-й степенью некоторой единицы.
□ Действительно, е*^ - специальная, по
теореме 1.1, е** =т|^.
І1 2 Ф О тодр, следовательно, существуют та
кие целые числа v и ц, что A2V +/п) = 1.
е = = (/е " )^ . ■
Следствие 2. Если верна теорема 1.1, то
верна теорема 1 .0 .
Допусти А2 S О т о ф , тогда по теореме
Коши в фактор-группе группы единиц по под
группе специальных единиц существует эле
мент порядка р, и, значит, в группе единиц су
ществует неспециальная единица е, для кото
рой единица е'' - специальная.
d" S с modp, поэтому в силу теоремы 1.1 в
кольце Z[Q существует такая специальная еди
60 Вестник БИТУ, № 4,2005
Естественные и точные науки
ница т], что = т]'’ и ет|“‘ = ę для некоторо
го а.
Следовательно, вопреки предположению,
единица е = ^‘’т| - специальная. Приходим к
противоречию. ■
Для полноты следует отметить, что я распо
лагаю собственным вариантом доказательства
первого случая теоремы Ферма.
Теорема. Для нерегулярного простого числа
р справедлив первый случай теоремы Ферма
•приусловии, что h2 p Оmodp.
Однако здесь оно не приводится.
Итак, доказаны теоремы (2.1) => (2.0);
(1.1) (1.0) и вместе с ними доказана великая
теорема Ферма.
В Ы В О Д Ы
в работе доказаны теоремы (1.0) и (2.0),
что, как известно, достаточно для полного до
казательства теоремы Ферма.
Эти теоремы рассмотрены с помощью двух
других теорем (1.1) и (2.1). Доказательство по
следних основано на арифметической теории
кругового поля Куммера с использованием тео
рии дивизоров и специальных единиц.
""";

Console.WriteLine(proof);